Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: You do not have to instantiate or manage the devices yourself, they are created at application start up before :code:`main()` is executed.
it_it: Non è necessario istanziare o gestire i dispositivi manualmente, poiché vengono creati all'avvio dell'applicazione prima dell'esecuzione di :code:`main()`.

source: You do not need to do this if you are using the provided value array(s) and setting values with ``lv_chart_set_...value_...()`` functions.
it_it: Non è necessario farlo se si utilizzano gli array di valori forniti e si impostano i valori con le funzioni ``lv_chart_set_...value_...()``.

source: You do this by first setting :c:macro:`LV_USE_OBJ_ID_BUILTIN` to `0` in ``lv_conf.h``.
it_it: Per farlo, si imposta prima :c:macro:`LV_USE_OBJ_ID_BUILTIN` a `0` in ``lv_conf.h``.

source: You don't have to define the macro :c:macro:`LV_USE_DRAW_ARM2D_SYNC` manually, instead the lv_conf_cmsis.h will check the environment and set the :c:macro:`LV_USE_DRAW_ARM2D_SYNC` accordingly.
it_it: Non è necessario definire manualmente la macro :c:macro:`LV_USE_DRAW_ARM2D_SYNC`, ma lv_conf_cmsis.h controllerà l'ambiente e imposterà :c:macro:`LV_USE_DRAW_ARM2D_SYNC` di conseguenza.

source: You get back a pointer to the Button created so you can add an event callback with it and/or whatever else might be needed.
it_it: Si ottiene un puntatore al Pulsante creato, in modo da poter aggiungere una callback di evento e/o qualsiasi altra cosa necessaria.

source: You have access to all the popular open source Arduino libraries.
it_it: Si ha accesso a tutte le librerie Arduino open source più diffuse.

source: You have several options to set the Y-values for a data series:
it_it: Sono disponibili diverse opzioni per impostare i valori Y per una serie di dati:

source: You have the development version of libinput installed (usually ``libinput-dev``).
it_it: È installata la versione di sviluppo di libinput (di solito ``libinput-dev``).

source: You have to add them if you want to use them.
it_it: È necessario aggiungerli se si desidera utilizzarli.

source: You have to add them.
it_it: Si devono aggiungere.

source: You make use of images by using any of these Widgets:
it_it: È possibile utilizzare le immagini utilizzando uno qualsiasi di questi Widget:

source: You may also need to set ``BOARD_ILI9806E_PANEL_VARIANT`` if the default does not match yours.
it_it: Potrebbe essere necessario impostare anche ``BOARD_ILI9806E_PANEL_VARIANT`` se il valore predefinito non corrisponde al proprio.

source: You may choose to initialize your IO the first time ``op_cb`` is called.
it_it: Si può scegliere di inizializzare l'IO la prima volta che viene chiamato ``op_cb``.

source: You may create **internal tools** to aid development using the Specification, but these must not be published, sold, or shared externally without a license.
it_it: È possibile creare **strumenti interni** per facilitare lo sviluppo utilizzando la Specifica, ma questi non devono essere pubblicati, venduti o condivisi esternamente senza una licenza.

source: You may encounter a blinking cursor on the screen.
it_it: Si potrebbe vedere un cursore lampeggiante sullo schermo.

source: You may need to configure the i2c address of the touch controller connected to EVE.
it_it: Potrebbe essere necessario configurare l'indirizzo I2C del controller touch connesso a EVE.

source: You may not have success with this speed so it is recommended to validate with an ``SPI_SPEED`` value of ``10`` (10 MHz) and increase experimentally in your testing.
it_it: Si potrebbero non ottenere risultati con questa velocità, quindi si consiglia di convalidare con un valore ``SPI_SPEED`` di ``10`` (10 MHz) e di aumentarlo sperimentalmente durante i test.

source: You may then open the LVGL project by using the command palette to run "LVGL: Open Editor".
it_it: È quindi possibile aprire il progetto LVGL utilizzando la palette dei comandi per eseguire "LVGL: Open Editor".

source: You may try using newer versions of LVGL.
it_it: È possibile provare a utilizzare versioni più recenti di LVGL.

source: You may use a custom HAL implementation for your platform or use one of the provided implementations by setting :c:macro:`LV_USE_NEMA_HAL` to a value other than :c:macro:`LV_NEMA_HAL_CUSTOM`.
it_it: È possibile utilizzare un'implementazione HAL personalizzata per la propria piattaforma oppure utilizzare una delle implementazioni fornite impostando :c:macro:`LV_USE_NEMA_HAL` su un valore diverso da :c:macro:`LV_NEMA_HAL_CUSTOM`.

source: You may want to react to a new device being added so that a cursor image can be applied, for example.
it_it: Si potrebbe voler reagire all'aggiunta di un nuovo dispositivo in modo che possa essere applicata un'immagine del cursore, ad esempio.

source: You must call :cpp:expr:`lv_draw_dma2d_transfer_complete_interrupt_handler()` when you receive the global interrupt that signals a DMA2D transfer has completed.
it_it: È necessario chiamare :cpp:expr:`lv_draw_dma2d_transfer_complete_interrupt_handler()` quando si riceve l'interrupt globale che segnala il completamento di un trasferimento DMA2D.

source: You must ensure each array provided contains at least ``point_count`` ``int32_t`` elements.
it_it: È necessario assicurarsi che ogni array fornito contenga almeno ``point_count`` ``int32_t`` elementi.

source: You must first define a remapping callback, then invoke :cpp:func:`lv_indev_set_key_remap_cb` to enable it.
it_it: Bisogna prima definire una callback di rimappatura, poi invocare :cpp:func:`lv_indev_set_key_remap_cb` per abilitarla.

source: You must install essential host packages on your build host.
it_it: È necessario installare i pacchetti host essenziali sul proprio host di build.

source: You need the following UEFI protocols available:
it_it: Sono necessari i seguenti protocolli UEFI disponibili:

source: You need to add some entries (at least ``"alif.setools.root"``) to the JSON you see.
it_it: Si devono aggiungere alcune voci (almeno ``"alif.setools.root"``) al JSON che si vede.

source: You need to be familiar with some Docker fundamentals to be able to understand and follow this guide.
it_it: È necessario avere familiarità con alcuni principi fondamentali di Docker per poter comprendere e seguire questa guida.

source: You need to be in the same terminal you did the ``source`` command.
it_it: Si deve stare nello stesso terminale in cui è stato eseguito il comando ``source``.

source: You need to disable the log output of other threads or refer to the configuration above to use a separate log output interface.
it_it: È necessario disabilitare l'output del log di altri thread o fare riferimento alla configurazione precedente per utilizzare un'interfaccia di output del log separata.

source: You need to have 3 buttons available:
it_it: È necessario disporre di 3 pulsanti:

source: You need to implement two platform-dependent functions:
it_it: È necessario implementare due funzioni dipendenti dalla piattaforma:

source: You need to install
it_it: È necessario installare

source: You need to reduce the baud rate.
it_it: È necessario ridurre il baud rate.

source: You now have a running LVGL application.
it_it: Ora si ha un'applicazione LVGL in esecuzione.

source: You register a driver for your file system and assign it an identifier letter.
it_it: Si registra un driver per il file system e gli si assegna una lettera identificativa.

source: You set a Section's Style properties by creating a :cpp:type:`lv_style_t` object for each "section" you want to appear different than the parent Scale.
it_it: Per impostare le proprietà di Stile di una Sezione, è possibile creare un oggetto :cpp:type:`lv_style_t` per ogni "sezione" che si desidera visualizzare in modo diverso rispetto alla Scala padre.

source: You set a ``target`` UI element and select one of its ``timeline``\ s to play.
it_it: Si imposta un elemento UI ``target`` e si seleziona una delle sue ``timeline`` da riprodurre.

source: You should also add the following lines to your input device read function to signal a wake-up (press, touch, click, etc.) has happened:
it_it: Si devono anche aggiungere le seguenti righe alla funzione di lettura del dispositivo di input per segnalare l'avvenuta riattivazione (pressione, tocco, clic, ecc.):

source: You should delete an Animation using :cpp:expr:`lv_anim_delete(var, func)` if one of these two conditions exists:
it_it: È necessario eliminare un'Animazione utilizzando :cpp:expr:`lv_anim_delete(var, func)` se si verifica una di queste due condizioni:

source: You should ensure the LTDC framebuffer memory is actually reserved in the linker script.
it_it: È necessario assicurarsi che la memoria del framebuffer LTDC sia effettivamente riservata nello script del linker.

source: You should ensure the sum of the RAM entries (``FB_RAM`` + ``RAM``) equals the total RAM of the device.
it_it: La somma delle voci RAM (``FB_RAM`` + ``RAM``) dev'essere uguale alla RAM totale del dispositivo.

source: You should exclusively use one or the other of the two methods.
it_it: Si consiglia di utilizzare esclusivamente uno dei due metodi.

source: You should find ``BR2_PACKAGE_LIBDRM`` set to **[=n]**.
it_it: Si dovrebbe trovare ``BR2_PACKAGE_LIBDRM`` impostato su **[=n]**.

source: You should now be able to see the recipe listing the existing recipes
it_it: Ora si dovrebbe essere in grado di visualizzare la ricetta con l'elenco delle ricette esistenti.

source: You should see a square with red-blue gradient.
it_it: Si dovrebbe vedere un quadrato con una sfumatura rosso-blu.

source: You should see the include folder and the .so files.
it_it: Si dovrebbero vedere la cartella "include" e i file .so.

source: You should translate some of the read keys to these special keys to support navigation in a group and interact with selected widgets.
it_it: Si devono tradurre alcuni dei tasti di lettura in questi tasti speciali per supportare la navigazione in un gruppo e interagire con i widget selezionati.

source: You should use them only if your question or issue is tightly related to the development of the library.
it_it: Si dovrebbero utilizzarli solo se la domanda o il problema è strettamente correlato allo sviluppo della libreria.

source: You should write **why** you did it: ``x++; /* Point to closing '\0' of string */``
it_it: Si dovrebbe scrivere il **perché** è stato fatto: ``x++; /* Point to closing '\0' of string */``

source: You specify what paths these lead to during ``lv_file_explorer``\ 's initialization.
it_it: È possibile specificare a quali path conducono durante l'inizializzazione di ``lv_file_explorer``.

source: You still need to provide the drivers and libraries, this extension provides only the bridge between LVGL and these file systems.
it_it: È comunque necessario fornire i driver e le librerie, questa estensione fornisce solo il "ponte" tra LVGL e questi file system.

source: You then need to attach an image decoder that will parse that bitmap and generate the real, render-able bitmap.
it_it: Si dovrà poi collegare un decoder di immagini che analizzerà la bitmap e genererà la bitmap reale, renderizzabile.

source: You use the log module via the following macros:
it_it: Il modulo di log può essere utilizzato tramite le seguenti macro:

source: You will also need to initialize your SPI peripheral and GPIO pins.
it_it: Si dovrà anche inizializzare la periferica SPI e i pin GPIO.

source: You will also see the patches that will be applied on the next step.
it_it: Si vedranno anche le patch che verranno applicate nel passaggio successivo.

source: You will also want to add the "libs/nema_gfx/include" directory to your include search paths.
it_it: Aggiungere anche la directory "libs/nema_gfx/include" ai percorsi di ricerca degli include.

source: You will find the following is a fairly-complete list of references about how to do things using reStructuredText:
it_it: Di seguito si troverà un elenco abbastanza completo di riferimenti su come utilizzare reStructuredText:

source: You will find these repositories at the following locations:
it_it: Questi repository si trovano nei seguenti posti:

source: You will have to account for the increased width and height of letter due to the added letter outline, to avoid letters overlapping space them out using :cpp:func:`lv_style_set_text_letter_space`
it_it: Bisognerà tenere conto dell'aumento di larghezza e altezza delle lettere dovuto all'aggiunta del contorno; per evitare sovrapposizioni, distanziarle utilizzando :cpp:func:`lv_style_set_text_letter_space`

source: You will need to enable :c:macro:`LV_USE_RLOTTIE` through **idf.py** menuconfig under LVGL component settings.
it_it: Sarà necessario abilitare :c:macro:`LV_USE_RLOTTIE` tramite **idf.py** di menuconfig nelle impostazioni del componente LVGL.

source: You will need to initialize the SD card before LVGL can use it (i.e. :cpp:expr:`SD.begin(0, SPI, 40000000)`).
it_it: Sarà necessario inizializzare la scheda SD prima che LVGL possa utilizzarla (ad esempio: :cpp:expr:`SD.begin(0, SPI, 40000000)`).

source: You will need to specify the header for LVGL to include internally for DMA2D definitions.
it_it: Si dovrà specificare l'header che LVGL deve includere internamente per le definizioni DMA2D.

source: You will need to then pass the :ref:`file-system <file_system>` path to the file containing your image as the ``src`` argument to :cpp:expr:`lv_image_set_src(icon, "S:my_icon.png")`, and LVGL takes care of the rest.
it_it: Si dovrà poi passare il path :ref:`file-system <file_system>` al file contenente l'immagine come argomento ``src`` a :cpp:expr:`lv_image_set_src(icon, "S:my_icon.png")`, e LVGL si occuperà del resto.

source: You will obtain a processed text file named `trace.systrace`, which roughly contains the following content:
it_it: Si otterrà un file di testo processato denominato `trace.systrace`, che contiene approssimativamente il seguente contenuto:

source: You will then need to provide implementations for the following functions (and link them with LVGL):
it_it: Sarà quindi necessario fornire le implementazioni per le seguenti funzioni (e linkarle a LVGL):

source: You will want to set the tick callback to ``HAL_GetTick``.
it_it: Si dovrà impostare la callback tick su ``HAL_GetTick``.

source: You won’t need to do anything manually, it stays up-to-date in the background.
it_it: Non sarà necessario eseguire alcuna operazione manualmente, poiché l'aggiornamento avviene in background.

source: You would also need display and input drivers.
it_it: Sono necessari anche driver di input e display.

source: You would need to set :c:macro:`LV_USE_PRIVATE_API` to ``1`` in ``lv_conf.h`` in order to do this since the definition of the :cpp:type:`lv_image_decoder_dsc_t` and :cpp:type:`_lv_image_decoder_args_t` structs are both in a private header file.
it_it: Per fare ciò, è necessario impostare :c:macro:`LV_USE_PRIVATE_API` a ``1`` in ``lv_conf.h``, poiché le definizioni delle strutture :cpp:type:`lv_image_decoder_dsc_t` e :cpp:type:`_lv_image_decoder_args_t` si trovano entrambe in un file header privato.

source: You write your embedded application logic and UI using the Arduino framework and its library ecosystem.
it_it: È possibile scrivere la logica e l'interfaccia utente dell'applicazione embedded utilizzando il framework Arduino e il suo ecosistema di librerie.

source: You'll combine your intentions when calling the first method, like in these examples:
it_it: Si combineranno le proprie intenzioni quando si chiamerà il primo metodo, come in questi esempi:

source: You'll use this name to declare and use the font in your code.
it_it: Si userà questo nome per dichiarare e utilizzare il font nel codice.

source: You're having issues setting up a local development environment
it_it: Si stanno riscontrando problemi con la configurazione di un ambiente di sviluppo locale

source: You're working from a device without a local IDE
it_it: Si sta lavorando da un dispositivo senza un IDE locale

source: Your editor needs to be configured to save your code/text as UTF-8 (usually this is the default) and be sure that :c:macro:`LV_TXT_ENC` is set to :c:macro:`LV_TXT_ENC_UTF8` in ``lv_conf.h``.
it_it: L'editor deve essere configurato per salvare il codice/testo come UTF-8 (solitamente è il default) e assicurarsi che :c:macro:`LV_TXT_ENC` sia impostato su :c:macro:`LV_TXT_ENC_UTF8` in ``lv_conf.h``.

source: Your machine is slow or underpowered
it_it: Il proprio computer è lento o sottodimensionato

source: Your own OpenGL context management
it_it: Gestione personalizzata del contesto OpenGL

source: Your own work
it_it: Il proprio lavoro

source: Your system has a framebuffer device configured (usually under ``/dev/fb0``).
it_it: Il sistema dispone di un dispositivo framebuffer configurato (solitamente in ``/dev/fb0``).

source: Your system has an input device configured (usually under ``/dev/input/`` such as ``/dev/input/event0``).
it_it: Il sistema dispone di un dispositivo di input configurato (solitamente in ``/dev/input/``, ad esempio ``/dev/input/event0``).

source: You’ll need to create a display configuration file, such as ``my_display.hpp`` similar to the example in `LovyanGFX user_setting.ino <https://github.com/lovyan03/LovyanGFX/blob/master/examples/HowToUse/2_user_setting/2_user_setting.ino>`__ In the Arduino IDE, you can create a new tab and name it ``my_display.hpp`` and paste the content of your configuration file there.
it_it: Si dovrà creare un file di configurazione del display, come ``my_display.hpp``, simile all'esempio in `LovyanGFX user_setting.ino <https://github.com/lovyan03/LovyanGFX/blob/master/examples/HowToUse/2_user_setting/2_user_setting.ino>`__ Nell'IDE di Arduino, si può creare un nuov "tab" e chiamarlo ``my_display.hpp``, quindi incollarvi il contenuto del proprio file di configurazione.

source: You’ll need to create a display configuration file, such as ``my_display.hpp`` similar to the example in `LovyanGFX user_setting.ino <https://github.com/lovyan03/LovyanGFX/blob/master/examples/HowToUse/2_user_setting/2_user_setting.ino>`__.
it_it: Si dovrà creare un file di configurazione del display, come ``my_display.hpp``, simile all'esempio in `LovyanGFX user_setting.ino <https://github.com/lovyan03/LovyanGFX/blob/master/examples/HowToUse/2_user_setting/2_user_setting.ino>`__.

source: Zephyr Discord server: `Zephyr Discord server <https://chat.zephyrproject.org/>`__
it_it: `Server Discord di Zephyr <https://chat.zephyrproject.org/>`__

source: Zephyr Documentation: `Zephyr Documentation <https://docs.zephyrproject.org/latest/index.html>`__
it_it: `Documentazione di Zephyr <https://docs.zephyrproject.org/latest/index.html>`__

source: Zephyr has its own configuration wrapper for LVGL that translates Kconfig options into LVGL settings.
it_it: Zephyr dispone di un proprio wrapper di configurazione per LVGL che traduce le opzioni di Kconfig in impostazioni LVGL.

source: Zephyr includes a powerful shell implementation that can be enabled with the Kconfig symbols :code:`CONFIG_SHELL` and :code:`CONFIG_LV_Z_SHELL` (the demos from above have it enabled by default).
it_it: Zephyr include una potente implementazione della shell abilitabile con i simboli Kconfig :code:`CONFIG_SHELL` e :code:`CONFIG_LV_Z_SHELL` (le demo precedenti la abilitano di default).

source: Zephyr is built with an emphasis on broad chipset support, security, dependability, long-term support releases and a growing open source ecosystem.
it_it: Zephyr è progettato con particolare attenzione all'ampio supporto di chipset, alla sicurezza, all'affidabilità, alle release con supporto a lungo termine e a un ecosistema open source in crescita.

source: Zephyr mailing list: `Zephyr Mailing List <https://lists.zephyrproject.org/g/main>`__
it_it: `Mailing list di Zephyr <https://lists.zephyrproject.org/g/main>`__

source: Zephyr uses the devicetree description language to create and manage LVGL input devices.
it_it: Zephyr utilizza il linguaggio di descrizione devicetree per creare e gestire dispositivi di input LVGL.

source: Zephyr ≤ 3.7.0 Specific Options
it_it: Opzioni specifiche per Zephyr ≤ 3.7.0

source: Zero degrees is at the middle right (3 o'clock) of the Widget and the degrees increasing in the clockwise direction.
it_it: Zero gradi si trova al centro a destra (ore 3) del Widget e i gradi aumentano in senso orario.

source: Zoom Widget horizontally.
it_it: Zoom orizzontale del Widget.

source: Zoom Widget vertically.
it_it: Zoom verticale del Widget.

source: Zoom controls
it_it: Controlli zoom

source: Zoom in and out
it_it: Zoom in e out

source: _layouts: <=== Creates an explicit link target
it_it: _layouts: <=== Crea un link target esplicito

source: `0`: Maximum speed
it_it: `0`: Velocità massima

source: `10`: 10× slower
it_it: `10`: 10 volte più lento

source: `1`: Real-time speed
it_it: `1`: Velocità in tempo reale

source: `2`: Half-speed
it_it: `2`: Velocità dimezzata

source: `A Cortex-M55 (supports Helium) based MDK Project, PC emulation is available.
it_it: `Un progetto MDK basato su Cortex-M55 (supporta Helium), disponibile per l'emulazione PC.

source: `Animation <https://github.com/lvgl/lv_binding_js/blob/master/doc/animate/animate.md>`__
it_it: `Animazione <https://github.com/lvgl/lv_binding_js/blob/master/doc/animate/animate.md>`__

source: `Berry <https://github.com/berry-lang/berry>`__ is a ultra-lightweight dynamically typed embedded scripting language.
it_it: `Berry <https://github.com/berry-lang/berry>`__ è un linguaggio di scripting embedded a tipizzazione dinamica ultraleggero.

source: `Berry Documentation <https://github.com/berry-lang/berry/wiki/Reference>`__
it_it: `Documentazione di Berry <https://github.com/berry-lang/berry/wiki/Reference>`__

source: `Blog Post <https://blog.lvgl.io/2019-02-20/micropython-bindings>`__, a little outdated.
it_it: `Post del Blog <https://blog.lvgl.io/2019-02-20/micropython-bindings>`__, un po' obsoleto.

source: `Build Notes for SDL Simulator (Linux and macOS) <https://github.com/lvgl/lv_binding_js/blob/master/doc/build/build-simulator.md>`__
it_it: `Note di build per SDL Simulator (Linux e macOS) <https://github.com/lvgl/lv_binding_js/blob/master/doc/build/build-simulator.md>`__

source: `Build Notes for embedded Linux device <https://github.com/lvgl/lv_binding_js/blob/master/doc/build/build-device.md>`__
it_it: `Note di build per dispositivi Linux embedded <https://github.com/lvgl/lv_binding_js/blob/master/doc/build/build-device.md>`__

source: `Click here to experiment on the online simulator <https://sim.lvgl.io/>`__
it_it: `Cliccare qui per sperimentare sul simulatore online <https://sim.lvgl.io/>`__

source: `Click here to learn more about building and running the Unix port.
it_it: `Cliccare qui per saperne di più sulla compilazione e l'esecuzione della versione Unix.

source: `Dahlia Carrier Board with HDMI Adapter <https://www.toradex.com/products/ carrier-board/dahlia-carrier-board-kit>`_
it_it: `Dahlia Carrier Board con HDMI Adapter <https://www.toradex.com/products/ carrier-board/dahlia-carrier-board-kit>`_

source: `Demo repository <https://github.com/lvgl/lv_port_renesas-ek-rz_a3m>`__
it_it: `Repository demo <https://github.com/lvgl/lv_port_renesas-ek-rz_a3m>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_ek-ra6m3g>`__
it_it: `Repository demo <https://github.com/lvgl/lv_port_renesas_ek-ra6m3g>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_ek-ra8d1>`__
it_it: `Repository delle demo <https://github.com/lvgl/lv_port_renesas_ek-ra8d1>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_ek-ra8d2>`__
it_it: `Deposito demo <https://github.com/lvgl/lv_port_renesas_ek-ra8d2>`__
